RoodsBurger/brushless_lamp/s3/archive/milestones/m3-leds/sdkconfig.defaults.esp32s3
CONFIG_IDF_TARGET="esp32s3"

## USB-C console via USB_SERIAL_JTAG.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

## PSRAM disabled — XIAO S3R8 needs Octal not Quad (same fix as M1/M2).
# CONFIG_SPIRAM is not set

## No BT, no WiFi — motor + knob + LEDs only.
CONFIG_BT_ENABLED=n
